# Inplace parameter

In [1]:
import pandas as pd

In [2]:
df_student_att = pd.read_csv("./datasets/students_score_att.csv")

In [3]:
df_student_att

       Name  Score Grades Attended
0      Paul     98     AA      Yes
1     Aaron     89     AB      Yes
2    Krista     99     AA      Not
3  Veronica     87     AB      Yes
4    Paxton     90     AC       No
5   Madison     83     BA      Yes
6    Aurora     82     BB       No

## 1. Dropping a column without inplace

In [4]:
df_student_att.drop("Grades", axis=1)

       Name  Score Attended
0      Paul     98      Yes
1     Aaron     89      Yes
2    Krista     99      Not
3  Veronica     87      Yes
4    Paxton     90       No
5   Madison     83      Yes
6    Aurora     82       No

Now we show the data again

In [5]:
df_student_att

       Name  Score Grades Attended
0      Paul     98     AA      Yes
1     Aaron     89     AB      Yes
2    Krista     99     AA      Not
3  Veronica     87     AB      Yes
4    Paxton     90     AC       No
5   Madison     83     BA      Yes
6    Aurora     82     BB       No

Notice that the data hasn't changed, even we just dropped a column

To actually change the data we add inplace parameter set to True

So that the dataframe variable `df_student_att` actually changed based on the operations we perform

## 2. Dropping a column using inplace parameter

In [6]:
df_student_att.drop("Grades", axis=1, inplace=True)

In [7]:
df_student_att

       Name  Score Attended
0      Paul     98      Yes
1     Aaron     89      Yes
2    Krista     99      Not
3  Veronica     87      Yes
4    Paxton     90       No
5   Madison     83      Yes
6    Aurora     82       No

Now that we dropped the "Grades" column and set the inplace parameter to True, the dataframe `df_student_att` has changed permanently

In [8]:
# The method
# df_student_att.drop("Grades", axis=1, inplace=True)
# is similar to
# df_student_att = df_student_att.drop("Grades", axis=1)